# Toposolid Is Smoothed Surface Enabled Method

Source: https://www.revitapidocs.com/2026/96dbefd0-7927-7a7e-dd50-536eb6c56e88.htm

---

| Toposolid Is Smoothed Surface Enabled Method |
| --- |

Gets smoothed surface setting of Toposolid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsSmoothedSurfaceEnabled(
	Document document
)
```

```
Public Shared Function IsSmoothedSurfaceEnabled (
	document As Document
) As Boolean
```

```
public:
static bool IsSmoothedSurfaceEnabled(
	Document^ document
)
```

```
static member IsSmoothedSurfaceEnabled :
        document : Document -> bool
```

#### Parameters

document Document
:   The document.

#### Return Value

Boolean
True if smoothed surface is enabled for Toposolid, otherwise return false. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace